export const siDoData = ["서울"];

export const siGunGuData: Record<string, string[]> = {
  서울: ["관악구"],
};

export const dongData: Record<string, string[]> = {
  관악구: [
    "낙성대동",
    "난곡동",
    "난향동",
    "남현동",
    "대학동",
    "미성동",
    "보라매동",
    "삼성동",
    "서림동",
    "서원동",
    "성현동",
    "신림동",
    "신사동",
    "신원동",
    "은천동",
    "인헌동",
    "조원동",
    "중앙동",
    "청룡동",
    "청림동",
    "행운동",
  ],
};

export const codeToName: Record<number, string> = {
  1162000000: "관악구",
  1162052500: "보라매동",
  1162054500: "청림동",
  1162056500: "성현동",
  1162057500: "행운동",
  1162058500: "낙성대동",
  1162059500: "청룡동",
  1162060500: "은천동",
  1162061500: "중앙동",
  1162062500: "인헌동",
  1162063000: "남현동",
  1162064500: "서원동",
  1162065500: "신원동",
  1162066500: "서림동",
  1162068500: "신사동",
  1162069500: "신림동",
  1162071500: "난향동",
  1162072500: "조원동",
  1162073500: "대학동",
  1162074500: "삼성동",
  1162076500: "미성동",
  1162077500: "난곡동",
};
